_protected/common/modules/adm/views/user/_form.php

                    ],
                    'role_id' => [
                        'type' => Form::INPUT_DROPDOWN_LIST,
                        'items' => ArrayHelper::map(common\modules\user\models\Role::find()->orderBy('name')->asArray()->all(), 'id', 'name')
---
SELECT * FROM `_role` ORDER BY `name`

    ]);
    ?>
    <?php
    $option_header_id = OptionHeader::findOne(["option_type" => "SYS_LANGUAGE"])->option_header_id;
---
SELECT * FROM `option_header` WHERE `option_type`='SYS_LANGUAGE'

        'model' => $profile,
        'form' => $form,
        'columns' => 3,
        'attributes' => [
            'user_language' => ['type' => Form::INPUT_DROPDOWN_LIST, 'items' => [ArrayHelper::map(OptionLine::find()->where(["option_header_id" => $option_header_id])->all(), 'option_line_id', 'description')]],
            'default_theme' => ['type' => Form::INPUT_DROPDOWN_LIST, 'items' => [ArrayHelper::map(ExtnTheme::find()->all(), 'extn_theme_id', 'theme_name')]],
            'block_notif_count' => ['type' => Form::INPUT_DROPDOWN_LIST, 'items' => [OptionHeader::$position_array]],
            'use_personal_db_cb' => ['type' => Form::INPUT_CHECKBOX],
        ]
    ]);
    ?>
    <?php
    $option_header_id = OptionHeader::findOne(["option_type" => "SYS_LANGUAGE"])->option_header_id;
---
SELECT * FROM `option_line` WHERE `option_header_id`='224'
SELECT * FROM `extn_theme`
SELECT * FROM `option_header` WHERE `option_type`='SYS_LANGUAGE'