_protected/common/modules/adm/controllers/UserController.php

    public function actionUpdate($id) {
        // set up user and profile
        $user = $this->findModel($id);
        $user->setScenario("admin");
        $profile = $user->profile;

        // load post data and validate
        $post = Yii::$app->request->post();

        if ($user->load($post) && $user->validate() && $profile->load($post) && $profile->validate()) {
---
SELECT * FROM `_profile` WHERE `user_id`=2

    protected function findModel($id) {
        /** @var \common\modules\user\models\User $user */
        $user = Yii::$app->getModule("user")->model("User");
        if (($user = $user::findOne($id)) !== null) {
---
SELECT * FROM `users` WHERE `user_id`='2'