_protected/common/modules/user/controllers/AuthController.php

SELECT * FROM `users`
SELECT * FROM `_profile` WHERE `user_id`=1
SELECT * FROM `address_reference` WHERE `reference_id`=1
---
    public function actionProfile() {
        $user = \common\modules\user\models\User::find(Yii::$app->user->id)->one();
        $profile = $user->profile;
        $addressReference= $user->addressReference;
        $address= new \common\modules\address\models\Address;
// load post data
        $post = Yii::$app->request->post();
        if ($user->load($post) && $user->validate() && $profile->load($post) && $profile->validate()) {