_protected/common/modules/site/views/default/index.php

SELECT * FROM `block` WHERE `block_id`='55'
---
                                <li>
                                    <h2>Notifications</h2>
                                    <?php
                                    $block_i = Block::findOne('55');

SELECT * FROM `block` WHERE `block_id`='52'
---
                                <li>
                                    <h2>Recent Comments</h2>
                                    <?php
                                    $block_i = Block::findOne('52');