_protected/common/modules/user/views/auth/tabs/tab-8.php

</div>
<div class="col-md-6">
    <?php
    $option_header_id = OptionHeader::findOne(["option_type" => "ADDRESS_USAGE_TYPE"])->option_header_id;
---
SELECT * FROM `option_header` WHERE `option_type`='ADDRESS_USAGE_TYPE'

        'model' => $address,
        'form' => $form,
        'columns' => 1,
        'attributes' => [
            'address_name' => ['type' => Form::INPUT_TEXT,],
            'type' => ['type' => Form::INPUT_TEXT,],
            'address_name' => ['type' => Form::INPUT_TEXT,],
            'mdm_tax_region_id' => ['type' => Form::INPUT_TEXT,],
            'description' => ['type' => Form::INPUT_TEXT,],
            'phone' => ['type' => Form::INPUT_TEXT,],
            'email' => ['type' => Form::INPUT_TEXT,],
            'website' => ['type' => Form::INPUT_TEXT,],
            'address' => ['type' => Form::INPUT_TEXT,],
            'country' => ['type' => Form::INPUT_TEXT,],
            'postal_code' => ['type' => Form::INPUT_TEXT,],
            'default_cb' => ['type' => Form::INPUT_TEXT,],
            'status' => ['type' => Form::INPUT_TEXT,],
            'usage_type' => ['type' => Form::INPUT_DROPDOWN_LIST,"placeholder"=>"--Select--", 'items' => [ArrayHelper::map(OptionLine::find()->where(["option_header_id" => $option_header_id])->all(), 'option_line_id', 'description')]],
            'rev_number' => ['type' => Form::INPUT_TEXT,]
        ],
---
SELECT * FROM `option_line` WHERE `option_header_id`='230'