_protected/common/modules/user/models/Role.php

    public static function dropdown()
    {
        // get and cache data
        static $dropdown;
        if ($dropdown === null) {

            // get all records from database and generate
            $models = static::find()->all();
---
SELECT * FROM `_role`