_protected/common/modules/user/models/User.php

SELECT * FROM `users` WHERE `user_id`=1
---
    public static function findIdentity($id) {
        return static::findOne($id);

UPDATE `users` SET `login_time`='2016-06-21 19:53:53' WHERE `user_id`=1
---
    public function updateLoginMeta() {
        // set data
        $this->login_ip = Yii::$app->getRequest()->getUserIP();
        $this->login_time = date("Y-m-d H:i:s");

        // save and return
        return $this->save(false, ["login_ip", "login_time"]);