_protected/common/modules/adm/views/default/index.php

SELECT * FROM `path` WHERE (`module_code`='adm') AND (`parent_id` IS NULL)
SELECT * FROM `path` WHERE `parent_id`=59
---
$path = Path::$icon_stmt_a[$module];
$this->title = $path["description"];

$parent_path = Path::findOne(["module_code" => $module, "parent_id" => null]);
$childs = Path::findAll(["parent_id" => $parent_path->path_id]);

SELECT * FROM `path` WHERE `parent_id`=26
---
                                        <i class="fa <?= $path["div_class"] ?>"></i> &nbsp; <?= $child_p->description ?></a>

                                    <?php
                                    $other_child_paths = Path::findAll(["parent_id" => $child_p->path_id]);